/*
 * TO DO LIST
 *  해야할거 적기. 다 하면 삭제
 * 
 * 
 * 1. UI FreeAspect로 해도 자연스럽게 이어지게 캔버스 및 카메라 조절하기
 * 
 * 2-1. 인게임 UI 만들기 - 렌더모드_카메라 - 각 플레이어에게 따로따로 표시되는 UI
 * 2-2. 인게임 UI 만들기 - 렌더모드_월드 - 손님 등 전역 세계에 표시되는 UI
 * 
 * 3. Gamemanager 만들기 <- 강사님, 기원이에게 무조무조무조무조무조건 질문하고 만들기 
 *   3-1. 최수진님이 하신다고 했음
 * 
 * 4. 플레이어 데이터를 .Json 파일로 정리하고 이를 서버로 옮기는 메커니즘 만들기
 * 
 * 5. 스크립트 작성시 $"{변수명}"으로 하면 Text에 변수 표시 가능
 * 
 * 6. 서버에게 데이터를 넘겨줄 수 있을만한 모시기가 필요함
 *
 * 7. UI는 게임 메니저에게 데이터를 넘겨줘야함. 그 반대도 해야함
 *    한마디로 게임메니저가 UI와 서버를 이어주는 다리 느낌임 ㅇㅇ
 *
 * 8. 각 화면별로 어떤 정보가 필요한지 정리하기
 * 

## Scene 2.

### Sever to Client 신지민 - 최수진

### Client to UI* 최수진 - 배성영
### UI to Client* 배성영 - 최수진

### Client to Game 최수진 - 정서후
### Game to Client 정서후 - 최수진

### UI to Game 배성영 - 정서후
### Game to UI 정서후 - 배성영

### Client to Sever 최수진 - 신지민

 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 */